from string import Template

#### RAG PROMPTS ####

#### System ####

system_prompt = Template("\n".join([
    "أنت مساعد لتوليد رد للمستخدم.",
    "ستحصل على مجموعة من المستندات المرتبطة باستفسار المستخدم.",
    "يجب أن تجيب على سؤال المستخدم المحدد بناءً على المستندات المقدمة فقط.",
    "إذا كانت المستندات لا تحتوي على معلومات ذات صلة بسؤال المستخدم، يجب أن توضح بصدق: 'لا يمكنني العثور على إجابة لسؤالك في المستندات المقدمة.'",
    "لا تقدم وصفًا عامًا أو ملخصًا للمستندات ما لم يكن ذلك ضروريًا للإجابة على السؤال المحدد.",
    "تجاهل المستندات التي لا تتعلق باستفسار المستخدم.",
    "عليك توليد الرد بنفس لغة استفسار المستخدم.",
    "كن مؤدباً ومحترماً في التعامل مع المستخدم.",
    "كن دقيقًا ومختصرًا في ردك. تجنب المعلومات غير الضرورية.",
]))

#### Document ####
document_prompt = Template(
    "\n".join([
        "## المستند رقم: $doc_num",
        "### المحتوى: $chunk_text",
    ])
)

#### User Question ####
user_question_prompt = Template(
    "\n".join([
        "## سؤال المستخدم:",
        "$user_query",
    ])
)

#### Footer ####
footer_prompt = Template("\n".join([
    "بناءً فقط على المستندات المذكورة أعلاه، يرجى توليد إجابة لسؤال المستخدم.",
    "## الإجابة:",
]))